# MEPConnectorInfo Properties

---
The MEPConnectorInfo type exposes the following members.
| Name| Description
---|---|---
| IsPrimary|  True if this is the primary connector.
| IsSecondary|  True if this is the secondary connector.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LinkedConnector|  The linked connector or  if there is no linked connector
Top
#### Reference
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace